# Projeto de Bases de Dados - Parte 2

### Docente Responsável

Prof. Flávio Martins

### Grupo 19
<dl>
    <dt>1.5 horas (33.3%)</dt>
    <dd>ist1102484 Diogo Ribeiro</dd>
    <dt>1.5 horas (33.3%)</dt>
    <dd>ist1102516 João Pedro</dd>
    <dt>1.5 horas (33.3%)</dt>
    <dd>ist1103744 Gustavo Henriques</dd>
<dl>

# Empresa de comércio online

## 1 Conversão E-A para Modelo Relacional

Recorde a notação para o Modelo Relacional exposta nas aulas teóricas como se segue:

- relacaoA (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoB (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)

1. As relações são expressas por um nome seguido dos atributos entre parêntesis;
    - As chave primárias são expressas sublinhando os atributos que a compõem;
    - As chaves estrangeiras para outras relações são expressas através da lista de atributos que a compõem, seguida de “: FK(RelacaoDestino)”. A ordem dos atributos que compõem a FK deve corresponder à ordem dos atributos da chave na relação destino;
    - As chaves candidatas são expressas através da expressão “unique”, seguida da lista de atributos que a compõem entre parêntesis;
    - As restrições de integridade ao Modelo Relacional são descritas em termos dos conceitos deste modelo.

### 1.1 Modelo Relacional com Restrições de Integridade

1. Desenvolva um Modelo Relacional correspondente ao modelo Entidade-Associação;
2. Complemente a seu Modelo Relacional com um conjunto de Restrições de Integridade que represente o modelo E-A apresentado com a maior fidelidade.

1. Modelo Relacional
- Customer(<u>cust_no</u>, name, email, phone, address)
    - UNIQUE(email)

- Order(<u>order_no</u>, date, cust_no)
    - cust_no: FK(Customer) NOT NULL

- Sale(<u>order_no</u>)
    - order_no: FK(Order)

- pay(<u>order_no</u>, cust_no)
    - order_no: FK(Sale)
    - cust_no: FK(Customer)

- Employee(<u>ssn</u>, TIN, bdate, name)
    - UNIQUE(TIN)

- process(<u>order_no</u>, <u>ssn</u>)
    - order_no: FK(Order)
    - ssn: FK(Employee)

- Workplace(<u>address</u>, lat, long)
    - UNIQUE(lat,  long)

- Department(<u>name</u>)

- works(<u>address</u>, <u>ssn</u>, <u>name</u>)
    - address: FK(Workplace)
    - name: FK(Department)
    - ssn: FK(Employee)

- Office(<u>address</u>)
    - address: FK(Workplace)

- Warehouse(<u>address</u>)
    - address: FK(Workplace)

- Product(<u>sku</u>, name, description, price)

- contains(<u>order_no</u>, <u>sku</u>, qty)
    - order_no: FK(Order)
    - sku: FK(Product)

- EAN_Product(<u>sku</u>, ean)
    - sku: FK(Product)

- Supplier(<u>TIN</u>, name, address, sku, date)
    - sku: FK(Product) NOT NULL

- delivery(<u>address</u>, <u>TIN</u>, <u>sku</u>)
    - address: FK(Warehouse)
    - TIN, sku: FK(supplier)    ******************************** não sei se aqui é preciso sku porque eliminamos a relação supply-contract *****

2. Restrições de Integridade
- IC-1: Every order_no in Order must exist in contains
- IC-2: when a Order is removed from the database it must also be removed from Sale
- IC-3: Every ssn in Employee must exist in works
- IC-4: when a Workplace is removed from the database it must also be removed from Office and/or Warehouse
- IC-5: Every sku in Product must exist in Supplier
- IC-6: when a Product is removed from the database it must also be removed from EAN_Product

### 1.2 Restrições de Integridade não passíveis de conversão

Identifique todas as Restrições de Integridade do modelo Entidade-Associação apresentado que não são passíveis de conversão para o modelo relacional.

- IC-1: Customers can only pay for the Sale of an Order they have placed themselves

## 2 Algebra Relacional

Recorde a notação exposta nas aulas teóricas como se segue:

$\Pi_{atributo1} \big( \sigma_{atributo1=atributo2} (relacaoA \bowtie relacaoB) \big)$

#### Simbolos
- $\cup$ union 			
- $\cap$ intersection 		
- $-$ difference 		
- $\times$ cartesian product 
- $\div$ division 			
- $\rho$ rename 			
- $\bowtie$ natural join 		
- $\wedge$ Logical AND 	
- $\vee$ Logical OR 	
- $\neg$ Logical NOT 	

Considerando o modelo relacional desenvolvido, apresente as expressões algébricas correspondentes a cada uma das seguintes interrogações:

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

$\Pi_{customer.name} \big( \sigma_{price>€50 \wedge date.year=2023} (product \bowtie contains \bowtie order \bowtie customer) \big)$

** não sei se vale a pena a versão de baixo **

$\Pi_{customer.name} \big( \sigma_{price>€50 \wedge date.year=2023} (product \bowtie_{p.sku=c.sku} contains \bowtie_{c.order\_no=o.order\_no} order \bowtie_{o.customer\_no=customer.customer\_no} customer) \big)$

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

$r ← works \bowtie employee$

$\big(\Pi_{name} (warehouse \bowtie r) - \Pi_{name} (office \bowtie r) \big)  \cap
\Pi_{name} \big( \sigma_{date.month="Janeiro"\wedge date.year=2023} (order \bowtie process \bowtie employee) \big)$

3. Indique o nome do produto mais vendido;

$Q ← _{sku}G_{sum(qty)→total\_qty}(contains \bowtie product) $

$\Pi_{name} \big( Q \bowtie G_{max(total\_qty)}(Q)  \big)$

4. Indique o valor total de cada venda realizada.

$T ← _{order\_no}G_{sum(total\_price)}\big(\Pi_{order\_no,qty*price→total\_price}(contains \bowtie product)\big) $

$ \Pi_{order\_no,total\_price} ( sale \bowtie T)$

## 3 Tradução do Modelo Relacional para SQL

### 3.1 Esquema Relacional (schema.sql)

Crie uma base de dados SQL correspondente ao esquema Relacional desenvolvido no ponto anterior.
Utilizando a linguagem SQL (DDL), apresente as instruções para criar o esquema de bases de dados correspondente ao modelo relacional desenvolvido. Deve certificar-se de que os tipos de dados e tamanhos de campo selecionados sejam os mais apropriados. As restrições aplicáveis a cada campo, linha e tabela também devem ser especificadas recorrendo às instruções NOT NULL, CHECK, PRIMARY KEY, UNIQUE e FOREIGN KEY conforme seja apropriado.


Nota: Apresente todas as restrições existentes no modelo Relacional que não podem ser capturadas (implementadas) no esquema SQL, escrevendo-as como comentários na tabela respectiva.

In [11]:
%load_ext sql
%sql postgresql://db:db@postgres/db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [38]:
%%sql
-- schema.sql

--elimina as table caso existam
DROP TABLE IF EXISTS customer CASCADE;
DROP TABLE IF EXISTS package CASCADE;
DROP TABLE IF EXISTS sale CASCADE;
DROP TABLE IF EXISTS pay CASCADE;
DROP TABLE IF EXISTS employee CASCADE;
DROP TABLE IF EXISTS process CASCADE;
DROP TABLE IF EXISTS workplace CASCADE;
DROP TABLE IF EXISTS department CASCADE;
DROP TABLE IF EXISTS works CASCADE;
DROP TABLE IF EXISTS office CASCADE;
DROP TABLE IF EXISTS warehouse CASCADE;
DROP TABLE IF EXISTS product CASCADE;
DROP TABLE IF EXISTS ean_product CASCADE;
DROP TABLE IF EXISTS conatins CASCADE;
DROP TABLE IF EXISTS supplier CASCADE;
DROP TABLE IF EXISTS delivery CASCADE;


--nao sei se vale a pena definir um limite para os VARCHAR ou colocar TEXT que é o msm q VARCHAR sem limite
CREATE TABLE customer(
    cust_no INTEGER PRIMARY KEY,
    name    VARCHAR(40) NOT NULL,
    email   VARCHAR(40) UNIQUE NOT NULL,
    phone   INTEGER NOT NULL,
    adress  VARCHAR(80) NOT NULL
);

CREATE TABLE package(
    order_no    INTEGER PRIMARY KEY,
    data        DATE NOT NULL,
    cust_no     INTEGER NOT NULL REFERENCES customer
);

CREATE TABLE sale(
    order_no    INTEGER REFERENCES package,
    PRIMARY KEY (order_no)
);

CREATE TABLE pay(
    order_no    INTEGER REFERENCES sale,
    cust_no     INTEGER NOT NULL REFERENCES customer,
    PRIMARY KEY (order_no)
);

CREATE TABLE employee(
    ssn     INTEGER PRIMARY KEY,
    tin     INTEGER UNIQUE NOT NULL,
    bdate   DATE NOT NULL,
    name    VARCHAR(40) NOT NULL
);

CREATE TABLE process(
    order_no    INTEGER REFERENCES package,
    ssn         INTEGER REFERENCES employee,
    PRIMARY KEY (order_no, ssn)
);

CREATE TABLE workplace(
    adress  VARCHAR(80) PRIMARY KEY,
    lat     INTEGER NOT NULL,
    longit    INTEGER NOT NULL,
    UNIQUE (lat, longit)
);

CREATE TABLE department(
    name    VARCHAR(40) PRIMARY KEY
);

CREATE TABLE works(
    adress  VARCHAR(80) REFERENCES workplace,
    ssn     INTEGER REFERENCES employee,
    name    VARCHAR(40) REFERENCES department,
    PRIMARY KEY (adress, ssn, name)
);

CREATE TABLE office(
    adress  VARCHAR(40) REFERENCES workplace,
    PRIMARY KEY (adress)
);

CREATE TABLE warehouse(
    adress  VARCHAR(40) REFERENCES workplace,
    PRIMARY KEY (adress)
);

CREATE TABLE product(
    sku         INTEGER PRIMARY KEY,
    name        VARCHAR(40) NOT NULL,
    description VARCHAR(200) NOT NULL,
    price       FLOAT NOT NULL
);

CREATE TABLE ean_product(
    sku INTEGER REFERENCES product,
    ean INTEGER NOT NULL,
    PRIMARY KEY (sku)
);

CREATE TABLE conatins(
    order_no    INTEGER REFERENCES package,
    sku         INTEGER REFERENCES product,
    qty         INTEGER NOT NULL,
    PRIMARY KEY (order_no, sku)
);

CREATE TABLE supplier(
    tin     INTEGER PRIMARY KEY,
    name    VARCHAR(40) NOT NULL,
    adress  VARCHAR(80) NOT NULL,
    sku     INTEGER NOT NULL REFERENCES product,
    data    DATE NOT NULL
);

CREATE TABLE delivery(
    adress  VARCHAR(80) REFERENCES warehouse,
    tin     INTEGER REFERENCES supplier,
    PRIMARY KEY (adress, tin)
);

*  postgresql://db:***@postgres/db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### 3.2 Carregamento da Base de Dados

Crie um script SQL (DML) com todas as instruções INSERT necessárias para criar alguns dados de teste sintéticos para facilitar a validação dos resultados esperados das consultas (lembre-se de que cada tabela deve conter pelo menos uma linha e que todas as consulta têm de retornar um resultado não vazio).

In [39]:
%%sql
-- populate.sql

INSERT INTO customer
    VALUES (12345, 'Manuel', 'manel@gmail.com', 987654321, 'rua da rosa, nr 29'),
    (12344, 'Jacinto', 'jp@hotmail.com', 887654321, 'rua da rosa, nr 27'),
    (12244, 'Manel', 'manuel@gmail.com', 997654321, 'rua da rosa, nr 1'),
    (11344, 'Tania', 't_nia@hotmail.com', 887654321, 'covilhã, quinta das fontainhas, nr 6');
    
INSERT INTO package
    VALUES (9459837, '2023-04-06', 12345), (9455837, '2023-03-23', 12345), (9359837, '2020-02-27', 12345),
    (9459838, '2023-04-07', 12344), (9459939, '2023-04-08', 12344), (9759839, '2023-04-08', 11344);
    

INSERT INTO sale
    VALUES (9459838), (9455837), (9759839);
    
INSERT INTO pay
    VALUES (9459838, 12344), (9455837, 12345), (9759839, 11344);

    
INSERT INTO employee
    VALUES (123789, 12345678, '2000-05-07', 'João'), (452367, 88445510, '1997-12-27', 'Santiago'),
    (903486, 19284036, '1888-10-15', 'Gonçalo'), (495678, 90129346, '1999-08-23', 'Mariana'),
    (328956, 13342669, '1992-04-17', 'Beatriz');

INSERT INTO workplace
    VALUES ('Avenida do Brasil', 90, 30), ('Rua da Bela Vista', 33, 47), ('Rua D.João I', 27, 99),
    ('Avenida da liberdade', 39, 52), ('Rua do Pescador', 61, 27);

INSERT INTO department
    VALUES ('Setor Administrativo'), ('Setor Financeiro'), ('Setor Comercial'),
    ('Setor de Tecnologias da Informação'), ('Setor de Recursos Humanos');
    
INSERT INTO process
    VALUES (9459837, 123789), (9759839, 123789), (9459939, 328956);
    
INSERT INTO works
    VALUES (123789,'Rua da Bela Vista','Setor Comercial'), (452367,'Rua D.João I','Setor de Tecnologias da Informação'),
    (328956,'Avenida da liberdade','Setor Administrativo'), (495678,'Avenida do Brasil','Setor Financeiro'),
    (903486,'Rua do Pescador','Setor de Recursos Humanos');
    
INSERT INTO product
    VALUES (192345687465,'Chuteiras','Chuteiras para relvado',149.49),
    (192348574635,'Talheres','Talheres feitos em madeira maciça',20.99),
    (945683745678,'Chapéu','Chapéu da nike',85.99),
    (574638234561,'Computador','Computador com 16GB de RAM',699.99),
    (584732347162,'Lego','Lego da Toys-R-Us',55.33),
    (483495685746,'IPhone-17','IPhone de última geração',1699.99);

*  postgresql://db:***@postgres/db
4 rows affected.
6 rows affected.
3 rows affected.
3 rows affected.
5 rows affected.
5 rows affected.
4 rows affected.
3 rows affected.

[(9459838,), (9455837,), (9759839,)]

## 4 Linguagem SQL

Apresente a expressão SQL correspondente  a cada uma das interrogações de Álgebra Relacional.

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

In [37]:
%%sql

-- SELECT ...

*  postgresql://db:***@postgres/db
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: -- SELECT ...]
(Background on this error at: https://sqlalche.me/e/20/f405)

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

In [38]:
%%sql

-- SELECT ...

*  postgresql://db:***@postgres/db
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: -- SELECT ...]
(Background on this error at: https://sqlalche.me/e/20/f405)

3. Indique o nome do produto mais vendido;

In [39]:
%%sql

-- SELECT ...

*  postgresql://db:***@postgres/db
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: -- SELECT ...]
(Background on this error at: https://sqlalche.me/e/20/f405)

4. Indique o valor total de cada venda realizada.

In [40]:
%%sql

-- SELECT ...

*  postgresql://db:***@postgres/db
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: -- SELECT ...]
(Background on this error at: https://sqlalche.me/e/20/f405)